let sampleData = [
	['チェックプログラム', 'check.txt', 'ブザー, 1\n右回転, 10\n左回転, 10\n進む, 10\nさがる, 10\n右ライト, 10\n左ライト, 10\n止まる, 0\n電子音, 3, 161\n電子音, 3, 143\n電子音, 3, 127\n電子音, 3, 120\n電子音, 3, 107\n電子音, 3, 95\n電子音, 3, 84\n電子音, 3, 79'],
	['さくら', 'sakura.txt', '電子音, 8, 34\n電子音, 8, 34\n電子音, 16, 31\n電子音, 8, 34\n電子音, 8, 34\n電子音, 16, 31\n電子音, 8, 34\n電子音, 8, 31\n電子音, 8, 29\n電子音, 8, 31\n電子音, 8, 34\n電子音, 4, 31\n電子音, 4, 34\n電子音, 16, 44\n電子音, 8, 46\n電子音, 8, 59\n電子音, 8, 46\n電子音, 8, 44\n電子音, 8, 46\n電子音, 4, 46\n電子音, 4, 59\n電子音, 16, 62'],
	['最初のプログラム', 'first.txt', '進む, 5\nさがる, 5\n右回転, 5\n左回転, 5\n止まる, 0\n電子音, 3, 135\n電子音, 3, 120\n電子音, 3, 107'],
    ['紅蓮華', 'crimson_lotus.txt', '電子音, 3, 39\n電子音, 3, 41\n電子音, 10, 39\n電子音, 3, 39\n電子音, 3, 41\n電子音, 6, 39\n止まる, 2\n電子音, 2, 78\n電子音, 3, 39\n電子音, 3, 41\n電子音, 6, 46\n電子音, 2, 52\n電子音, 2, 59\n電子音, 8, 52\n止まる, 2\n電子音, 4, 62\n電子音, 2, 52\n電子音, 10, 46\n電子音, 4, 46\n電子音, 2, 39\n電子音, 10, 34\n電子音, 4, 39\n電子音, 2, 34\n電子音, 16, 30'], 
	['とっても長い名前のサンプルプログラム', 'very_long_name_sample.txt', '進む, 5'],
];
